{"begining": {"text": " \n        {}, вы опытный бизнесмен со стажем предпринимательской \n    деятельности - именно такой агент нужен НИИ этнографии и \n    космоархеологии имени Грега Рафмана. Наш институт имеет научную \n    станцию на планете Боннасис (система Процион), которая \n    занимается изучением местных низкоразвитых племен - мензолов. \n         Для исследований нам необходимо получить у этих племен \n    ценный артефакт - медного идола. Получить его возможно только \n    одним способом - купить. Мы пытались это сделать, но потерпели \n    неудачу. Теперь мы готовы выплатить 65535 cr тому, кому удастся \n    выкупить у аборигенов этот артефакт. Важно сделать это до 10 Мая \n    3019, когда мы планируем собрать специальную конференцию по \n    этому поводу. По прибытии на станцию вас встретят наши научные \n    сотрудники, которые ознакомят вас с деталями. \n", "inventory": {}, "steps": {"1": {"text": "\t1. Отправиться в лагерь ученых на планете Боннасис.", "next_step": "camp"}}}, "camp": {"text": " \n        Вы достигли лагеря ученых-этнографов и посадили свой корабль \n    на стоянке. Лагерь представлял собой площадку, огороженную \n    деревянным частоколом, с пластиковыми палатками и одним \n    металлическим домиком посередине. Вы не успели как следует \n    осмотреться, как к вам подошел человек, одетый в меховую куртку, \n    с костяными бусами на шее и в уборе из листьев на голове. \n        - Приветствую вас, {}, - он протянул вам руку. - Мы ждем вас \n    со дня на день. Как долетели? \n        - Спасибо, весьма комфортно, - вы пожали ему руку, с трудом \n    преодолев опасение заразиться какой-нибудь местной экзотической \n    болезнью. \n        - Я Рене Маккалистер, начальник этой станции. Давайте выпьем \n    по стаканчику гуанавы, и я введу вас в курс дела. Вы скоро \n    поймете, какого рода услуги нам требуются и для чего вы нам \n    нужны. \n        Вы вошли в одну из пластиковых палаток. К вашему удивлению, \n    внутри она оказалась весьма цивилизованной - мебель, аппаратура, \n    кровать с водяным матрасом в углу. Маккалистер посадил вас за \n    стол, поставил два стакана и большую бутыль с темным коричневым \n    напитком. Маккалистер сделал несколько попыток открыть пробку; \n    наконец ему это удалось, но пробка отскочила и упала прямо под \n    вашим стулом. Произнеся какое-то местное ругательство, ученый \n    принялся искать пробку под столом и рядом с собой. \n", "inventory": {}, "steps": {"1": {"text": "\t1. Поднять пробку и отдать Маккалистеру.", "next_step": "give_probe"}, "2": {"text": "\t2. Поднять пробку и положить в карман.", "next_step": "take_probe"}}}, "give_probe": {"text": " \n        Пробка была очень красивой - из мягкой породы красного \n    дерева, инкрустированная изящным узором из золотистого пластика. \n    Вы протянули ее Маккалистеру. \n        - Очень правильный поступок с точки зрения мензольской \n    психологии! - прокомментировал он ваши действия. - Запомните: \n    даже если мензол выбросил какую-то вещь, она все равно \n    принадлежит ему! И вы не можете ею завладеть, просто подняв ее с \n    земли. Вы все равно должны будете эту вещь купить. Впрочем, есть \n    одно исключение: если мензол выбросил вещь на деревенскую \n    свалку, то это значит, что она ему не нужна. Любой может взять \n    ее оттуда бесплатно, хотя это и считается дурным тоном... Ну, \n    ладно. Так как я не мензол, то я дарю вам эту пробку в качестве \n    сувенира, а также для наглядной иллюстрации различия наших \n    культур. \n        С этими словами он наполнил ваш, а потом и свой стакан \n    тягучей жидкостью, от которой несло чем-то древесным. \n        - Пожалуйста, угощайтесь, - предложил Маккалистер. \n", "inventory": {"Пробка от гуанавы": 1}, "steps": {"1": {"text": "\t1. Далее.", "next_step": "task"}}}, "take_probe": {"text": " \n        Пробка была очень красивой - из мягкой породы красного \n    дерева, инкрустированная изящным узором из золотистого пластика. \n    Очень хороший сувенир! К сожалению, Маккалистер заметил вашу \n    маленькую клептоманическую акцию и сделал вам суровую отповедь: \n         - А вот так не поступайте в деревне мензолов ни в коем \n    случае! Воровство - это самое страшное преступление в среде \n    мензолов. За него вас могут даже убить, если поймают. И, \n    главное, вы навсегда потеряете уважение мензолов. Запомните: \n    даже если мензол выбросил какую-то вещь, она все равно \n    принадлежит ему! И вы не можете ею завладеть, просто подняв ее с \n    земли. Вы все равно должны будете эту вещь купить. Впрочем, есть \n    одно исключение: если мензол выбросил вещь на деревенскую \n    свалку, то это значит, что она ему не нужна. Любой может взять \n    ее оттуда бесплатно, хотя это и считается дурным тоном... Если \n    уж вам так понравилась эта пробка, то можете оставить ее у себя. \n    Кстати, мензол на моем месте никогда бы не сделал вам подарка. \n    Вы в любом случае должны были бы купить у него пробку или дать \n    ему что-нибудь взамен... \n        Наконец Маккалистер махнул рукой и наполнил ваш, а потом и \n    свой стакан тягучей жидкостью, от которой несло чем-то \n    древесным. \n        - Пожалуйста, угощайтесь, - предложил он. \n", "inventory": {"Пробка от гуанавы": 1}, "steps": {"1": {"text": "\t1. Далее.", "next_step": "task"}}}, "task": {"text": " \n        - Итак, я продолжу. Планета Боннасис представляет собой \n    весьма интересное явление с точки зрения космической этнографии. \n    Уже восемь лет мы изучаем племена мензолов, живущие здесь. Одно \n    из их поселений находится совсем недалеко, на другом конце \n    озера, - он указал рукой в окно. - До нас здесь были биологи и \n    хорошо изучили их организмы. Не вдаваясь в термины, скажу, что \n    это нечто среднее между ортодальным гуманоидом, драдическим \n    медведем и палеопигмеем. Впрочем, для нас важно не это. \n        Вы внимательно слушали, вежливо вращая в руках стакан \n    гуанавы и делая вид, что не страдаете от жажды. Впрочем, ваш \n    собеседник уже с удовольствием опорожнил свой стакан и наливал \n    себе еще. \n        - Очень питательный напиток, изготовленный из коры трататоги \n    и печенки местных зеленых муравьев. Мы научились его готовить по \n    рецептам мензолов. Попробуйте, это очень полезно. \n        Вы сделали робкий глоток. Внимательно прислушавшись к своим \n    ощущениям, вы поняли, что лучше было этого не делать. Такого \n    острого желания выпить стакан воды вы не испытывали с тех пор, \n    как десять лет назад проглотили гацинского жука. Впрочем, не \n    желая обижать собеседника, вы изобразили удовлетворенное мычание \n    и спросили: \n        - Итак, для чего вам нужен я? \n        - Для небольшой коммерческой операции. Видите ли, господин \n    {}, мы специально искали опытного торговца, способного \n    выторговать у мензолов ценную реликвию, необходимую для наших \n    исследований - медный идол Мгагуча. Мензолы очень ценят его и \n    никогда не отдадут бесплатно. \n", "inventory": {}, "steps": {"1": {"text": "\t1. У меня есть кое какие вопросы.", "next_step": "questions"}, "2": {"text": "\t2. Давайте приступим. Чем быстрее мы начнем, тем быстрее закончим.", "next_step": "start"}}}, "questions": {"text": " \n        - Конечно, спрашивайте, - сказал Маккалистер. - Для этого я \n    и сижу здесь. \n", "inventory": {}, "steps": {"1": {"text": "\t1. И зачем вам этот идол? Что в нем такого особенного, что ради него вы наняли меня?.", "next_step": "why_idol"}, "2": {"text": "\t2. А почему вы просто не выкрадете его?.", "next_step": "why_not_stil"}, "3": {"text": "\t3. И что, у вас не получилось купить у них этого идола? Я вижу, у вас достаточно их реликвий.", "next_step": "why_not_buy"}, "4": {"text": "\t4. И что же, вы думаете, этот предмет можно выкупить? И они его продадут?.", "next_step": "can_buy"}, "5": {"text": "\t5. Сколько примерно может стоить этот идол в местной валюте?.", "next_step": "how_much"}, "6": {"text": "\t6. Есть какие-то особые правила общения с мензолами, которые я должен знать?.", "next_step": "rules_to_speak"}, "7": {"text": "\t7. Что ж, давайте приступим. Чем быстрее мы начнем, тем быстрее закончим.", "next_step": "start"}}}, "why_idol": {"text": " \n        - В том-то и дело, что это отнюдь не простой местный божок, \n    - ответил Маккалистер. - Дело не столько в нем самом, сколько в \n    его составе. Видите ли, в недрах планеты Боннасис крайне низко \n    содержание такого металла, как медь. Между тем Мгагуча - \n    предмет, сделанный большей частью из меди. Я бы не поверил в \n    это, если бы не видел его собственными глазами. Он принадлежит \n    вождю местного племени. Идол, совершенно очевидно, изготовлен из \n    металлического сплава, поэтому мензолы так его ценят. Более \n    того, легенда, связанная с идолом, прямо говорит о том, что он \n    пришел с неба. Из всего этого можно сделать только один вывод: в \n    прошлом мензолы имели контакты с другими цивилизациями, которые \n    оказали какое-то воздействие на их культуру. Какое именно - это \n    мы и хотим выяснить. И первое, что нам следует сделать, это \n    тщательно исследовать идола Мгагучу - посмотреть, из каких \n    сплавов он состоит, и какая технология использовалась при его \n    изготовлении. Если наши предположения окажутся верными, и в \n    древности мензолы действительно контактировали с другими мирами, \n    это будет означать переворот в нашем понимании их культуры. Как \n    вы понимаете, все это станет возможным только в том случае, если \n    мы заполучим артефакт. Поэтому он так важен для нас. \n", "inventory": {}, "steps": {"1": {"text": "\t1. У меня есть еще вопрос.", "next_step": "questions"}, "2": {"text": "\t2. Давайте приступим. Чем быстрее мы начнем, тем быстрее закончим.", "next_step": "start"}}}, "why_not_stil": {"text": " \n        Маккалистер покачал головой: \n        - Если даже они просто обнаружат пропажу, то это сразу \n    ухудшит наши отношения, потому что они прекрасно знают о том, \n    как нам нужен этот предмет. А мы ценим наши хорошие отношения с \n    мензолами, поскольку только благодаря этому мы можем проводить \n    наши исследования и вообще безбоязненно существовать на этой \n    планете. Мы исследователи, а не варвары. \n", "inventory": {}, "steps": {"1": {"text": "\t1. У меня есть еще вопрос.", "next_step": "questions"}, "2": {"text": "\t2. Давайте приступим. Чем быстрее мы начнем, тем быстрее закончим.", "next_step": "start"}}}, "why_not_buy": {"text": " \n        - Нет, не получилось. Мы предлагали им наши приборы, наши \n    палатки, я был готов отдать им всю свою лабораторию. Мы \n    специально для них заказывали сувениры с Земли и Рахиша. Ничего \n    не помогает, - Маккалистер печально махнул рукой. - Похоже, \n    мензолов просто не интересует то, чего они не понимают. Им \n    интересны только вещи их собственной культуры, их ценности, их \n    деньги. Чужого им не нужно. А у нас нет их ценных вещей. Эти \n    статуэтки и тотемы, - он указал рукой на полку, где стояло \n    множество фигурок, - для них не представляют никакой ценности. \n    То есть, мензолы просто отдали их нам, потому что они были им не \n    нужны, по ряду причин, а выбрасывать их на свалку им запрещали \n    разные табу... Или взять, например, ту же гуанаву. Мы переняли у \n    мензолов рецепт ее производства и теперь делаем ее сами. Причем \n    наша гуанава получается значительно более чистой, чем у \n    мензолов. Но мы не можем ее продать, потому что по местным \n    обычаям только шаманы имеют право торговать гуанавой. А это \n    значит, что ни один мензол никогда не купит гуанаву ни у кого \n    другого. \n", "inventory": {}, "steps": {"1": {"text": "\t1. Давайте приступим. Чем быстрее мы начнем, тем быстрее закончим.", "next_step": "start"}, "2": {"text": "\t2. У меня есть еще вопрос.", "next_step": "questions"}}}, "can_buy": {"text": " \n        Маккалистер впервые за весь разговор отставил в сторону свой \n    стакан гуанавы (уже третий), наклонился к вам и хитро улыбнулся: \n         - Да. Мензолы - чрезвычайно меркантильный народ. \n    Теоретически, если найти правильный подход, можно заставить \n    мензола продать что угодно. Все мензолы, от мала до велика, от \n    крестьянина до вождя - заядлые и очень азартные менялы. Они \n    торгуют всем и вся. Они могут продать вам все, что у них есть, и \n    купить то, что им понравится. Мензол может сдать вам самого себя \n    в аренду, в рабство, или с легкостью предложить то же вам. \n    Мензол может потерять голову и продать вам последнее, что у него \n    есть, даже если потом он пожалеет об этом. Но железные законы их \n    этики никогда не позволят им обжаловать или оспорить совершенную \n    сделку. Либо же вы можете приобрести большое уважение мензола, и \n    он продаст вам то, что не продал бы при других обстоятельствах. \n    Это культура, сплошь состоящая из купли-продажи, их менталитет - \n    менталитет брокера. Мензолы весьма мирный народ, но они \n    оправдывают убийство, если оно совершается в качестве наказания \n    за покушение на чужую собственность или обман при торговой \n    операции, что для них одно и то же. Практически все наши \n    исследования посвящены тому, откуда у этой нации столько \n    меркантилизма и любви к торговле, почему они так любят деньги и \n    процесс торговли как таковой. Я работаю над этим феноменом очень \n    долгое время, однако до сих пор не смог найти удовлетворительных \n    ответов на эти вопросы... Но нам никогда не удавалось что-либо \n    купить у мензолов. Нет у нас и их денег, точнее, у нас их всего \n    десять и мы заработали их тем, что вылечили одного из них от \n    сенного гриппа. \n", "inventory": {}, "steps": {"1": {"text": "\t1. У меня есть еще вопрос.", "next_step": "questions"}, "2": {"text": "\t2.   Давайте приступим. Чем быстрее мы начнем, тем быстрее закончим.", "next_step": "start"}}}, "how_much": {"text": " \n        - Это зависит от того, насколько хорошо относится к вам все \n    племя и сам вождь. Именно вождь укажет вам цену, если, конечно, \n    он вообще согласится продать вам Мгагучу. Мензолы часто \n    назначают цену в зависимости от личных симпатий. Поэтому не \n    спрашивайте у вождя про Мгагучу, пока не будете полностью \n    уверены в его к вам расположении. Думаю, цена будет около 250 \n    мензолеров. Может быть и меньше, если повезет, но в любом случае \n    не меньше 200 мензолеров. \n", "inventory": {}, "steps": {"1": {"text": "\t1. У меня есть еще вопрос.", "next_step": "questions"}, "2": {"text": "\t2. Давайте приступим. Чем быстрее мы начнем, тем быстрее закончим.", "next_step": "start"}}}, "rules_to_speak": {"text": " \n        - Запомните следующее, - ответил Маккалистер. - Главное, \n    будьте максимально вежливы. Мы ни в коем случае не хотим \n    ссориться с мензолами. Старайтесь не показывать себя умнее их, \n    они это очень не любят. Учтите, что мензолы уважают только одно \n    право - право собственности, и только одно качество - \n    предприимчивость. Никогда не оспаривайте торговые операции. \n    Помните, что они не прощают воровства. Ну и еще, конечно, - он \n    подмигнул, - используйте ваш коммерческий талант! \n", "inventory": {}, "steps": {"1": {"text": "\t1. У меня есть еще вопрос.", "next_step": "questions"}, "2": {"text": "\t2. Давайте приступим. Чем быстрее мы начнем, тем быстрее закончим.", "next_step": "start"}}}, "start": {"text": " \n        - Прекрасно, я рад, что вы согласны помочь, - Маккалистер \n    пожал вашу руку. - Однако вам понадобится еще кое-что. Вот \n    десять мензольских денежных единиц, мензолеров, которые у нас \n    есть, - он положил на стол перед вами несколько костяных бляшек \n    разной формы. - Вам это пригодится. Теперь подойдите сюда, - он \n    встал и подошел к полке, на которой стояла деревянная статуэтка, \n    и протянул ее вам. - Это Ранинта, бывшая третья жена вождя, \n    которую он выгнал из племени после того, как она ему изменила. \n    После этого статуэтка потеряла всякую цену, и вождь решил \n    избавиться от нее. Лучшего способа это сделать, чем подарить \n    нам, он не нашел. Возьмите ее, простые мензолы могут ее купить; \n    только не показывайте вождю, а то рискуете заслужить его \n    немилость... Так, что же еще, - Маккалистер прошел в другой \n    конец комнаты. - Ах, да! Вот, - он достал из ящика стола \n    небольшой прибор с черной пластиковой ручкой и металлическим \n    блестящим наконечником. - Ручной станнер. Запомните, господин \n    {}, исключительно на крайний случай! Этот прибор блокирует \n    нервную систему, выводя из сознательного состояния на несколько \n    часов, в зависимости от массы организма. На мензолов действует \n    безотказно. Я даю вам его только потому, что мы отвечаем за вашу \n    безопасность. Будет очень плохо, если в результате ваших \n    действий мензолы станут враждебными по отношению ко всем \n    кшонгам, в том числе и к нам. Кшонги? Так мензолы называют всех \n    инопланетян. Кстати, наш лагерь они зовут Блестящей Деревней. \n         - Понятно. Когда мы отбываем? \n        - Прямо сейчас. Только сначала мы загрузим вам языковой \n    модуль. Прошу сюда, в лабораторию. \n", "inventory": {"Мензолеров": 10, "Станнер": 1, "Статуэтка Ранинты": 1}, "steps": {"1": {"text": "\t1. Далее.", "next_step": "enter_village"}}}, "enter_village": {"text": " \n        Через полчаса, после того как специалист нейронного \n    кодирования загрузил в ваш мозг модуль языка мензолов, вы вышли \n    наружу, где вас с нетерпением ждал Маккалистер. \n        - Днга аугг кганга длоотта кму? - спросил он вас. \n        - Ээнти экринта кганга лупуп, - ответили вы, поражаясь своим \n    новым лингвистическим способностям. \n        - Хорошо, загрузка и адаптация прошли успешно. Сейчас я \n    отвезу вас на другой конец озера, в племя Айока. Мгагуча \n    находится у вождя. \n         \n        Вы достигли берега озера и сели в небольшой пятиместный \n    катер. По дороге Маккалистер рассказывал вам смешные истории, \n    которые с ним приключались за время его работы на этой планете; \n    впрочем, вы нашли их весьма скучными и могли лишь \n    констатировать, что долгое пребывание в условиях жаркого климата \n    и общение с дикарями поспособствовали деградации чувства юмора у \n    этого человека. \n        На противоположном конце озера вы вышли на берег, усеянный \n    камнями и костями. \n        - Не бойтесь, - Маккалистер улыбнулся, заметив, как у вас \n    помрачнел взгляд. - Мензолы совершенно безобидны, если не \n    покушаться на их собственность. Тем более, они никогда не тронут \n    инопланетянина. Эти кости выбрасывает сюда Мурза, местный \n    охотник. Считается, что чем больше костей находится вокруг \n    жилища мензола, тем большая его ждет удача. Вот так, - он пожал \n    плечами и улыбнулся. - Итак, сударь, здесь я вас оставлю. Катер \n    я также оставляю у берега - мы внушили мензолам, что это \n    священная водяная повозка, и тех, кто до нее дотронется, ждет \n    неминуемая смерть. Теперь они на сто ярдов не подходят к катеру. \n    Воспользуйтесь им, когда будете возвращаться. \n        - А как вы сами вернетесь? - спросили вы, но в тот же момент \n    поняли, зачем Маккалистер оставил свою куртку и головной убор в \n    лагере. \n        - Я доберусь вплавь, - он хитро улыбнулся. - Я переплываю \n    это озеро за сорок восемь минут тринадцать секунд - таков мой \n    последний рекорд. Может быть, сегодня я его побью. Деревня - \n    дальше по пляжу, за устьем реки, - и с этими словами Маккалистер \n    нырнул в воду и поплыл брасом, как заправский пловец. \n", "inventory": {}, "steps": {"1": {"text": "\t1. Идти в деревню.", "next_step": "end"}, "2": {"text": "\t2. Поднять с земли кость.", "next_step": "end"}}}}